

def confession():
    lang = \
"""| :) 养猪专业户 2021-01-03 10:40
|   我想说的是，其实咱们几个本来是很好的朋友关系，但是，我发现我对你的感情变了，由最初的朋友关系，变为想和你成为恋人。
|   还有，你身上有很多的闪光点吸引我，那个努力变好的你，那个越来越自信的你，当然，还有那个美丽善良的你
|   虽然，你说你也有缺点，比如你说自己胖，但是在我看来那都没什么
|   姝鹏，你是一个很好的女孩，我希望你幸福
|   但更希望带给你幸福的人是我
|   如果你想跑马了，我可以陪你一起跑[偷笑]
|   或者当你独自跑马的时候我也可以在终点等你
|   那么问题来了
|   你愿意给我一个机会吗
| 
| :) 猪猪 2021-01-03 11:18
|   那试试叭[呲牙]
| 
| :) 养猪专业户 2021-01-03 11:20
|   请赐教[耶]
"""

    lang = \
"""| :) 养猪专业户 2021-01-03 10:40                                                                                    |
| 我想说的是，其实咱们几个本来是很好的朋友关系，但是，我发现我对你的感情变了，由最初的朋友关系，变为想和你成为恋人。|
| 还有，你身上有很多的闪光点吸引我，那个努力变好的你，那个越来越自信的你，当然，还有那个美丽善良的你                |
| 虽然，你说你也有缺点，比如你说自己胖，但是在我看来那都没什么                                                      |
| 姝鹏，你是一个很好的女孩，我希望你幸福                                                                            |
| 但更希望带给你幸福的人是我                                                                                        |
| 如果你想跑马了，我可以陪你一起跑[偷笑]                                                                            |
| 或者当你独自跑马的时候我也可以在终点等你                                                                          |
| 那么问题来了                                                                                                      |
| 你愿意给我一个机会吗                                                                                              |
|                                                                                                                   |
| :) 猪猪 2021-01-03 11:18                                                                                          |
| 那试试叭[呲牙]                                                                                                    |
|                                                                                                                   |
| :) 养猪专业户 2021-01-03 11:20                                                                                    |
| 请赐教[耶]                                                                                                        |
"""
    print()
    print("+" + "-" * 115 + "+")
    print(lang, end="")
    print("+" + "-" * 115 + "+")


def first_show():
    """
    表白
    :return:
    """
    print()
    print("\n\t\t+", end="")
    print("-" * 40, end="+")
    print("\n\t\t|\t\t\t\t\t |", end="")
    print()
    print("\t\t|\t     *^_^*     *^_^*\t\t |", end="")
    print("\n\t\t|\t\t\t\t\t |\n\t\t|\t\t\t\t\t |\n\t\t|     我的世界从此以后多了一个你\t |", end="")
    print("\n\t\t|\t\t\t\t\t |\n\t\t|     有时天晴有时雨\t\t\t |", end="")
    print("\n\t\t|\t\t\t\t\t |\n\t\t|     阴天时候我会告诉你\t\t |", end="")
    print("\n\t\t|\t\t\t\t\t |\n\t\t|     我爱你，胜过彩虹的美丽！！\t |", end="")
    print("\n\t\t|\t\t\t\t\t |\n\t\t|\t\t\t\t\t |\n\t\t|     -*- 姝鹏·我的彩虹女孩 !!! -*-     |")
    print("\t\t|\t\t\t\t\t |")
    print("\t\t|\t\t\t\t -庆龙-  |")
    print("\t\t+" + "-" * 40, end="+")
    print()
    print()

    print("\n\t\t\t * Jan 03 11:18 CST 2021 *\n\n")


if __name__ == '__main__':
    confession()

    # first_show()
