
def day_2021_0214():
    record = \
"""
:) 养猪专业户 2021-02-14 00:17
从最开始叫你姝鹏到现在叫你媳妇，我觉得好幸福。在一起的第一个情人节，没能在你身边
:) 猪猪 00:18
没在身边不重要呀~相反我很喜欢假期你能陪在父母身边呀~以后的很多很多节都在一起的[爱心]
谢谢老公的爱~么么哒[飞吻]
媳妇有个小小的请求
:) 养猪专业户 00:21
是的，父母和你都是我最亲近的人
媳妇有何吩咐[呲牙]
:) 猪猪 00:22
还有两天你就要回上海了，这两天再多一点时间替我陪陪爸爸妈妈[爱心]
等你回上海，我们有的是时间[爱心][爱心]
:) 养猪专业户 00:23
好，媳妇真好[亲亲]
:) 猪猪 00:25
白头偕老以后的几十年都是彼此的，祝相看两不厌[爱心]
:) 养猪专业户 00:26
哈哈，请多指教[调皮][爱心]
:) 猪猪 00:26
情人节不在身边，七夕可以[偷笑]
:) 养猪专业户 00:27
到时候，七夕好好安排一下[阴险]
:) 猪猪 00:29
我可以有期待嘛
:) 养猪专业户 00:29
当然啦[偷笑]，也可以出谋划策的，媳妇军师[阴险]
:) 猪猪 00:30
[偷笑][偷笑]
"""

    print(record)

if __name__ == '__main__':
    day_2021_0214()
